Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
Compares two diagram settings objects.
other:
Diagram settings object to compare with.
Returns:
True if objects are equal, false otherwise.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineLineWeight
Line weight of outline and fence lines in the diagram.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineColor
Color of outline and fence lines in the diagram.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Transparency
Transparency percentage of diagram color fill
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: transparency is less than 0 or greater than 100
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Rounding
Increment to which numeric values of analysis results are rounded in diagram.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: rounding is not positive
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextLabelType
Type of diagram text label visualization.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.FenceType
Type of diagram fence visualization.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor
Constructs a default instance of diagram settings.
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
Contains diagram settings for analysis display style element.
Since:
2012